docs/intro.org
#+html_head: <link rel="stylesheet" href="css/org-page.css"/>
#+title: intro of jojo-in-python

* getting start

*** install form pip package

    #+begin_src sh
    pip install jojo --user
    #+end_src

*** install from github

    #+begin_src sh
    git clone git@github.com:xieyuheng/jojo-in-python.git
    cd jojo-in-python
    pip install . --user
    #+end_src

*** start the interpreter

    - make sure the interpreter is in your PATH,
      and type 'jojo' to start the interpreter.

    - in the interpreter, type 'bye' to leave it.

* data stack

  - you can put data into the data-stack,
    and use jojo as an postfix notation calculator.

  #+begin_src jojo
  ;0>
  1

  ;1> 1
  2

  ;2> 1 2
  add

  ;1> 3
  dup

  ;2> 3 3
  mul

  ;1> 9
  #+end_src

* comment

  #+begin_src jojo
  ;; line comment

  (note
    comment in sexp)
  #+end_src

* stack operation

  #+begin_src jojo
  ;0>
  1 2 3

  ;1> 1

  ;2> 1 2

  ;3> 1 2 3
  dup

  ;4> 1 2 3 3
  drop

  ;3> 1 2 3
  over

  ;4> 1 2 3 2
  drop

  ;3> 1 2 3
  tuck

  ;4> 1 3 2 3
  drop

  ;3> 1 3 2
  swap

  ;3> 1 2 3
  #+end_src

* (+jojo) -- define function

  #+begin_src jojo
  ;0>
  (+jojo square dup mul)

  ;0>
  3

  ;1> 3
  square

  ;1> 9
  #+end_src

* list processing

  #+begin_src jojo
  ;0>
  1 2 null cons cons

  ;1> 1

  ;2> 1 2

  ;3> 1 2 (list)

  ;2> 1 (list 2)

  ;1> (list 1 2)
  dup list-append

  ;2> (list 1 2) (list 1 2)

  ;1> (list 1 2 1 2)
  dup

  ;2> (list 1 2 1 2) (list 1 2 1 2)
  car

  ;2> (list 1 2 1 2) 1
  over

  ;3> (list 1 2 1 2) 1 (list 1 2 1 2)
  cdr

  ;3> (list 1 2 1 2) 1 (list 2 1 2)
  cons

  ;2> (list 1 2 1 2) (list 1 2 1 2)
  equal?

  ;1> true
  #+end_src

* local variable

*** :local-name! & :local-name

    #+begin_src jojo
    (+jojo dup
      :x! ;; put the object at the top of data-stack to local-name :x
      :x  ;; get an object out of the local-name :x
      :x)

    ;0>
    2 dup dup

    ;1> 2

    ;2> 2 2

    ;3> 2 2 2
    #+end_src

