docs/intro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-12 Tue 17:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>intro of jojo-in-python</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" href="css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">intro of jojo-in-python</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b4d77b">getting start</a>
<ul>
<li><a href="#org1091337">install form pip package</a></li>
<li><a href="#org6192c69">install from github</a></li>
<li><a href="#org75956ec">start the interpreter</a></li>
</ul>
</li>
<li><a href="#orgb4d8685">data stack</a></li>
<li><a href="#orge224e76">comment</a></li>
<li><a href="#orgc18e1ec">stack operation</a></li>
<li><a href="#orgfc63539">(+jojo) &#x2013; define function</a></li>
<li><a href="#org1ef8540">list processing</a></li>
<li><a href="#org50378f7">local variable</a>
<ul>
<li><a href="#orgb6b727">:local-name! &amp; :local-name</a></li>
<li><a href="#orgfc2d21b">(-&gt; :local-name &#x2026;)</a></li>
</ul>
</li>
<li><a href="#org86bd8c4">(begin) &#x2013; sequential</a></li>
<li><a href="#org73810ee">(clo) &#x2013; closure</a></li>
<li><a href="#org29137a5">condition</a>
<ul>
<li><a href="#org3f961ce">ifte</a></li>
<li><a href="#org8896a83">(if)</a></li>
<li><a href="#orgb631504">(when)</a></li>
<li><a href="#orgaad1555">(cond)</a></li>
</ul>
</li>
<li><a href="#orgbc04abf"><span class="todo _gt__lt_">&gt;&lt;</span> built-in datatypes</a>
<ul>
<li><a href="#org1a85388">List</a></li>
<li><a href="#orgc3ab866">Vect &#x2013; vector</a></li>
<li><a href="#org47d2bd5">Dict &#x2013; dictory</a></li>
<li><a href="#org383f3c5">Tuple</a></li>
<li><a href="#org633898">Set</a></li>
</ul>
</li>
<li><a href="#org3d87ecb"><span class="todo _gt__lt_">&gt;&lt;</span> (+data) &#x2013; define new datatype</a></li>
<li><a href="#orgd96b663">(+union)</a></li>
<li><a href="#org49401ac"><span class="todo _gt__lt_">&gt;&lt;</span> multiple dispatching</a>
<ul>
<li><a href="#orgb7dfbfc">(+gene) &#x2013; define generic function prototype</a></li>
<li><a href="#org554a18f">(+disp) &#x2013; dispatching function</a></li>
</ul>
</li>
<li><a href="#orgc3ee7ea"><span class="todo _gt__lt_">&gt;&lt;</span> built-in generics</a>
<ul>
<li><a href="#orgf841b85">p &#x2013; print</a></li>
<li><a href="#org3691d23">equal?</a></li>
<li><a href="#orgc8250f2">repr</a></li>
</ul>
</li>
<li><a href="#orgd048e80"><span class="todo _gt__lt_">&gt;&lt;</span> macro system</a>
<ul>
<li><a href="#org91e60c9">(quote)</a></li>
<li><a href="#org8eea16d"><span class="todo _gt__lt_">&gt;&lt;</span> </a></li>
</ul>
</li>
<li><a href="#org5de185c"><span class="todo _gt__lt_">&gt;&lt;</span> testing</a>
<ul>
<li><a href="#org5fbf020">(assert) &amp; (assert!)</a></li>
</ul>
</li>
<li><a href="#org730a94a"><span class="todo _gt__lt_">&gt;&lt;</span> import python module</a></li>
<li><a href="#orgfa21030"><span class="todo _gt__lt_">&gt;&lt;</span> create jojo module</a></li>
<li><a href="#org21fcf7d"><span class="todo _gt__lt_">&gt;&lt;</span> command line interface</a></li>
<li><a href="#org6a1d476"><span class="todo _gt__lt_">&gt;&lt;</span> writing script</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8b4d77b" class="outline-2">
<h2 id="org8b4d77b">getting start</h2>
<div class="outline-text-2" id="text-org8b4d77b">
</div><div id="outline-container-org1091337" class="outline-3">
<h3 id="org1091337">install form pip package</h3>
<div class="outline-text-3" id="text-org1091337">
<div class="org-src-container">

<pre class="src src-sh">pip install jojo --user
</pre>
</div>
</div>
</div>

<div id="outline-container-org6192c69" class="outline-3">
<h3 id="org6192c69">install from github</h3>
<div class="outline-text-3" id="text-org6192c69">
<div class="org-src-container">

<pre class="src src-sh">git clone git@github.com:xieyuheng/jojo-in-python.git
<span style="color: #a6e22e;">cd</span> jojo-in-python
pip install . --user
</pre>
</div>
</div>
</div>

<div id="outline-container-org75956ec" class="outline-3">
<h3 id="org75956ec">start the interpreter</h3>
<div class="outline-text-3" id="text-org75956ec">
<ul class="org-ul">
<li><p>make sure the interpreter is in your PATH,</p><p>and type 'jojo' to start the interpreter.</p></li>

<li><p>in the interpreter, type 'bye' to leave it.</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-orgb4d8685" class="outline-2">
<h2 id="orgb4d8685">data stack</h2>
<div class="outline-text-2" id="text-orgb4d8685">
<ul class="org-ul">
<li><p>you can put data into the data-stack,</p><p>and use jojo as an postfix notation calculator.</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #ae81ff;">1</span>

;1&gt; <span style="color: #ae81ff;">1</span>
<span style="color: #ae81ff;">2</span>

;2&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span>
add

;1&gt; <span style="color: #ae81ff;">3</span>
dup

;2&gt; <span style="color: #ae81ff;">3</span> <span style="color: #ae81ff;">3</span>
mul

;1&gt; <span style="color: #ae81ff;">9</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge224e76" class="outline-2">
<h2 id="orge224e76">comment</h2>
<div class="outline-text-2" id="text-orge224e76">
<div class="org-src-container">

<pre class="src src-jojo">;; line comment

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  comment in sexp<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc18e1ec" class="outline-2">
<h2 id="orgc18e1ec">stack operation</h2>
<div class="outline-text-2" id="text-orgc18e1ec">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span>

;1&gt; <span style="color: #ae81ff;">1</span>

;2&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span>

;3&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span>
dup

;4&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span> <span style="color: #ae81ff;">3</span>
drop

;3&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span>
over

;4&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span> <span style="color: #ae81ff;">2</span>
drop

;3&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span>
tuck

;4&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">3</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span>
drop

;3&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">3</span> <span style="color: #ae81ff;">2</span>
swap

;3&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc63539" class="outline-2">
<h2 id="orgfc63539">(+jojo) &#x2013; define function</h2>
<div class="outline-text-2" id="text-orgfc63539">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> square dup mul<span style="color: #696969;">)</span>

;0&gt;
<span style="color: #ae81ff;">3</span>

;1&gt; <span style="color: #ae81ff;">3</span>
square

;1&gt; <span style="color: #ae81ff;">9</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ef8540" class="outline-2">
<h2 id="org1ef8540">list processing</h2>
<div class="outline-text-2" id="text-org1ef8540">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> null cons cons

;1&gt; <span style="color: #ae81ff;">1</span>

;2&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span>

;3&gt; <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span><span style="color: #696969;">)</span>

;2&gt; <span style="color: #ae81ff;">1</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>

;1&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>
dup list-append

;2&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>

;1&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>
dup

;2&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>
car

;2&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> <span style="color: #ae81ff;">1</span>
over

;3&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> <span style="color: #ae81ff;">1</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>
cdr

;3&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> <span style="color: #ae81ff;">1</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>
cons

;2&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span>
equal?

;1&gt; <span style="color: #66d9ef; font-weight: bold;">true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org50378f7" class="outline-2">
<h2 id="org50378f7">local variable</h2>
<div class="outline-text-2" id="text-org50378f7">
</div><div id="outline-container-orgb6b727" class="outline-3">
<h3 id="orgb6b727">:local-name! &amp; :local-name</h3>
<div class="outline-text-3" id="text-orgb6b727">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> dup
  <span style="color: #fd971f;">:x!</span> ;; put the object at the top of data-stack to local-name <span style="color: #a6e22e;">:x</span>
  <span style="color: #a6e22e;">:x</span>  ;; get an object out of the local-name <span style="color: #a6e22e;">:x</span>
  :x<span style="color: #696969;">)</span>

;0&gt;
<span style="color: #ae81ff;">2</span> dup dup

;1&gt; <span style="color: #ae81ff;">2</span>

;2&gt; <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">2</span>

;3&gt; <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">2</span>
</pre>
</div>
</div>
</div>
