docs/intro.org
*** (-> :local-name ...)

    #+begin_src jojo
    ;0>
    (+jojo hi (-> :name String, :age Nat)
      "hi " p :name p ", you are " p :age p " years old." p nl)

    ;0>
    ["xieyuheng" 5 hi]
    hi xieyuheng, you are 5 years old.
    #+end_src

* (begin) -- sequential

  #+begin_src jojo
  ;0>
  (begin
    1 2 add dup mul)

  ;1> 9
  [1 2 add dup mul] ;; [...] is syntax sugar of (begin ...)

  ;2> 9 9
  equal?

  ;1> true
  #+end_src

* (clo) -- closure

  #+begin_src jojo
  ;0>
  3 (clo dup mul) apply

  ;1> 3

  ;2> 3 {dup mul} ;; {...} is syntax sugar of (clo ...)

  ;1> 9
  {dup mul} apply

  ;2> 9 {dup mul}

  ;1> 81
  #+end_src

* condition

*** ifte

    #+begin_src jojo
    ;0>
    (begin
      1 1 add 2 eq?
      {"in true branch." p nl}
      {"in false branch." p nl}
      ifte)
    in true branch.

    ;0>
    (begin
      1 1 add 2 eq? not
      {"in true branch." p nl}
      {"in false branch." p nl}
      ifte)
    in false branch.
    #+end_src

*** (if)

    #+begin_src jojo
    ;0>
    (if [1 1 add 2 eq?]
      ["in true branch." p nl]
      ["in false branch." p nl])
    in true branch.

    ;0>
    (if [1 1 add 2 eq? not]
      ["in true branch." p nl]
      ["in false branch." p nl])
    in false branch.
    #+end_src

*** (when)

    #+begin_src jojo
    ;0>
    (when [1 1 add 2 eq?]
      "in when branch." p nl)
    in when branch.
    #+end_src

*** (cond)

    #+begin_src jojo
    ;0>
    (+jojo list-length (-> :list -- Int)
      (cond [:list null?] 0
            else [:list .cdr list-length inc]))

    ;0>
    (list 1 2 3) list-length

    ;1> (list 1 2 3)

    ;1> 3
    #+end_src

* >< built-in datatypes

*** List

    #+begin_src jojo

    #+end_src

*** Vect -- vector

    #+begin_src jojo

    #+end_src

*** Dict -- dictory

    #+begin_src jojo

    #+end_src

*** Tuple

    #+begin_src jojo

    #+end_src

*** Set

    #+begin_src jojo

    #+end_src

* >< (+data) -- define new datatype

  #+begin_src jojo
  (+data )
  #+end_src

* (+union)

* >< multiple dispatching

*** (+gene) -- define generic function prototype

*** (+disp) -- dispatching function

* >< built-in generics

*** p -- print

*** equal?

*** repr

* >< macro system

*** (quote)

*** ><

* >< testing

*** (assert) & (assert!)

    #+begin_src jojo

    #+end_src

