docs/intro.html

<div id="outline-container-orgfc2d21b" class="outline-3">
<h3 id="orgfc2d21b">(-&gt; :local-name &#x2026;)</h3>
<div class="outline-text-3" id="text-orgfc2d21b">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> hi <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:name</span> <span style="color: #66d9ef; font-weight: bold;">String</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:age</span> <span style="color: #66d9ef; font-weight: bold;">Nat</span><span style="color: #696969;">)</span>
  <span style="color: #e6db74;">"hi "</span> p <span style="color: #a6e22e;">:name</span> p <span style="color: #e6db74;">", you are "</span> p <span style="color: #a6e22e;">:age</span> p <span style="color: #e6db74;">" years old."</span> p nl<span style="color: #696969;">)</span>

;0&gt;
<span style="color: #797979;">[</span><span style="color: #e6db74;">"xieyuheng"</span> <span style="color: #ae81ff;">5</span> hi<span style="color: #797979;">]</span>
hi xieyuheng<span style="color: #f92672; font-weight: bold;">,</span> you are <span style="color: #ae81ff;">5</span> years old.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org86bd8c4" class="outline-2">
<h2 id="org86bd8c4">(begin) &#x2013; sequential</h2>
<div class="outline-text-2" id="text-org86bd8c4">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">begin</span>
  <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> add dup mul<span style="color: #696969;">)</span>

;1&gt; <span style="color: #ae81ff;">9</span>
<span style="color: #797979;">[</span><span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> add dup mul<span style="color: #797979;">]</span> ;; <span style="color: #797979;">[</span><span style="color: #ae81ff;">...</span><span style="color: #797979;">]</span> is syntax sugar of <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">begin</span> ...<span style="color: #696969;">)</span>

;2&gt; <span style="color: #ae81ff;">9</span> <span style="color: #ae81ff;">9</span>
equal?

;1&gt; <span style="color: #66d9ef; font-weight: bold;">true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org73810ee" class="outline-2">
<h2 id="org73810ee">(clo) &#x2013; closure</h2>
<div class="outline-text-2" id="text-org73810ee">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #ae81ff;">3</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">clo</span> dup mul<span style="color: #696969;">)</span> apply

;1&gt; <span style="color: #ae81ff;">3</span>

;2&gt; <span style="color: #ae81ff;">3</span> <span style="color: #B380A8;">{</span>dup mul<span style="color: #B380A8;">}</span> ;; <span style="color: #B380A8;">{</span><span style="color: #ae81ff;">...</span><span style="color: #B380A8;">}</span> is syntax sugar of <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">clo</span> ...<span style="color: #696969;">)</span>

;1&gt; <span style="color: #ae81ff;">9</span>
<span style="color: #B380A8;">{</span>dup mul<span style="color: #B380A8;">}</span> apply

;2&gt; <span style="color: #ae81ff;">9</span> <span style="color: #B380A8;">{</span>dup mul<span style="color: #B380A8;">}</span>

;1&gt; <span style="color: #ae81ff;">81</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org29137a5" class="outline-2">
<h2 id="org29137a5">condition</h2>
<div class="outline-text-2" id="text-org29137a5">
</div><div id="outline-container-org3f961ce" class="outline-3">
<h3 id="org3f961ce">ifte</h3>
<div class="outline-text-3" id="text-org3f961ce">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">begin</span>
  <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">1</span> add <span style="color: #ae81ff;">2</span> eq?
  <span style="color: #B380A8;">{</span><span style="color: #e6db74;">"in true branch."</span> p nl<span style="color: #B380A8;">}</span>
  <span style="color: #B380A8;">{</span><span style="color: #e6db74;">"in false branch."</span> p nl<span style="color: #B380A8;">}</span>
  ifte<span style="color: #696969;">)</span>
in <span style="color: #66d9ef; font-weight: bold;">true</span> branch.

;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">begin</span>
  <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">1</span> add <span style="color: #ae81ff;">2</span> eq? not
  <span style="color: #B380A8;">{</span><span style="color: #e6db74;">"in true branch."</span> p nl<span style="color: #B380A8;">}</span>
  <span style="color: #B380A8;">{</span><span style="color: #e6db74;">"in false branch."</span> p nl<span style="color: #B380A8;">}</span>
  ifte<span style="color: #696969;">)</span>
in <span style="color: #66d9ef; font-weight: bold;">false</span> branch.
</pre>
</div>
</div>
</div>

<div id="outline-container-org8896a83" class="outline-3">
<h3 id="org8896a83">(if)</h3>
<div class="outline-text-3" id="text-org8896a83">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">1</span> add <span style="color: #ae81ff;">2</span> eq?<span style="color: #797979;">]</span>
  <span style="color: #797979;">[</span><span style="color: #e6db74;">"in true branch."</span> p nl<span style="color: #797979;">]</span>
  <span style="color: #797979;">[</span><span style="color: #e6db74;">"in false branch."</span> p nl<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
in <span style="color: #66d9ef; font-weight: bold;">true</span> branch.

;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">1</span> add <span style="color: #ae81ff;">2</span> eq? not<span style="color: #797979;">]</span>
  <span style="color: #797979;">[</span><span style="color: #e6db74;">"in true branch."</span> p nl<span style="color: #797979;">]</span>
  <span style="color: #797979;">[</span><span style="color: #e6db74;">"in false branch."</span> p nl<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
in <span style="color: #66d9ef; font-weight: bold;">false</span> branch.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb631504" class="outline-3">
<h3 id="orgb631504">(when)</h3>
<div class="outline-text-3" id="text-orgb631504">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">when</span> <span style="color: #797979;">[</span><span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">1</span> add <span style="color: #ae81ff;">2</span> eq?<span style="color: #797979;">]</span>
  <span style="color: #e6db74;">"in when branch."</span> p nl<span style="color: #696969;">)</span>
in when branch.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaad1555" class="outline-3">
<h3 id="orgaad1555">(cond)</h3>
<div class="outline-text-3" id="text-orgaad1555">
<div class="org-src-container">

<pre class="src src-jojo">;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> list-length <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:list</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">Int</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:list</span> null?<span style="color: #797979;">]</span> <span style="color: #ae81ff;">0</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:list</span> <span style="color: #ae81ff;">.cdr</span> list-length inc<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

;0&gt;
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span><span style="color: #696969;">)</span> list-length

;1&gt; <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">list</span> <span style="color: #ae81ff;">1</span> <span style="color: #ae81ff;">2</span> <span style="color: #ae81ff;">3</span><span style="color: #696969;">)</span>

;1&gt; <span style="color: #ae81ff;">3</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbc04abf" class="outline-2">
<h2 id="orgbc04abf"><span class="todo _gt__lt_">&gt;&lt;</span> built-in datatypes</h2>
<div class="outline-text-2" id="text-orgbc04abf">
</div><div id="outline-container-org1a85388" class="outline-3">
<h3 id="org1a85388">List</h3>
<div class="outline-text-3" id="text-org1a85388">
<div class="org-src-container">

<pre class="src src-jojo"></pre>
</div>
</div>
</div>

<div id="outline-container-orgc3ab866" class="outline-3">
<h3 id="orgc3ab866">Vect &#x2013; vector</h3>
<div class="outline-text-3" id="text-orgc3ab866">
<div class="org-src-container">

<pre class="src src-jojo"></pre>
</div>
</div>
</div>

<div id="outline-container-org47d2bd5" class="outline-3">
<h3 id="org47d2bd5">Dict &#x2013; dictory</h3>
<div class="outline-text-3" id="text-org47d2bd5">
<div class="org-src-container">

<pre class="src src-jojo"></pre>
</div>
</div>
</div>

<div id="outline-container-org383f3c5" class="outline-3">
<h3 id="org383f3c5">Tuple</h3>
<div class="outline-text-3" id="text-org383f3c5">
<div class="org-src-container">

<pre class="src src-jojo"></pre>
</div>
</div>
</div>

<div id="outline-container-org633898" class="outline-3">
<h3 id="org633898">Set</h3>
<div class="outline-text-3" id="text-org633898">
<div class="org-src-container">

<pre class="src src-jojo"></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d87ecb" class="outline-2">
<h2 id="org3d87ecb"><span class="todo _gt__lt_">&gt;&lt;</span> (+data) &#x2013; define new datatype</h2>
<div class="outline-text-2" id="text-org3d87ecb">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd96b663" class="outline-2">
<h2 id="orgd96b663">(+union)</h2>
</div>

<div id="outline-container-org49401ac" class="outline-2">
<h2 id="org49401ac"><span class="todo _gt__lt_">&gt;&lt;</span> multiple dispatching</h2>
<div class="outline-text-2" id="text-org49401ac">
</div><div id="outline-container-orgb7dfbfc" class="outline-3">
<h3 id="orgb7dfbfc">(+gene) &#x2013; define generic function prototype</h3>
<div class="outline-text-3" id="text-orgb7dfbfc">
<div class="org-src-container">

<pre class="src src-jojo"></pre>
</div>
</div>
</div>

<div id="outline-container-org554a18f" class="outline-3">
<h3 id="org554a18f">(+disp) &#x2013; dispatching function</h3>
<div class="outline-text-3" id="text-org554a18f">
<div class="org-src-container">

<pre class="src src-jojo"></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc3ee7ea" class="outline-2">
<h2 id="orgc3ee7ea"><span class="todo _gt__lt_">&gt;&lt;</span> built-in generics</h2>
